0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 4.90e-1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 4.90e-1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }  
    SlipBC 
    {
        type            omegaWallFunction;
        value           uniform 1000;
    }
    walls
    {
        type            omegaWallFunction;
        value           uniform 1000;
    }
    cylinder
    {
        type            omegaWallFunction;
        value           uniform 1000;
    }
}


// ************************************************************************* //
